---
kind: type
id: T:Autodesk.Revit.DB.Electrical.PanelScheduleData
source: html/d24fcc19-3240-8f07-68ca-ce7b62f7aac3.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData

The PanelScheduleData class holds most of the data that describe
 the layout, appearance, and style of the rows, columns, and cells
 of a panel schedule

## Syntax (C#)
```csharp
public class PanelScheduleData : TableData
```